@echo off
title Multi-tool
:snart
chcp 65001 >nul
goto banner


:banner
echo.
echo.
echo ███╗   ███╗██╗   ██╗██╗  ████████╗██╗   ████████╗ ██████╗  ██████╗ ██╗     
echo ████╗ ████║██║   ██║██║  ╚══██╔══╝██║   ╚══██╔══╝██╔═══██╗██╔═══██╗██║     
echo ██╔████╔██║██║   ██║██║     ██║   ██║█████╗██║   ██║   ██║██║   ██║██║     
echo ██║╚██╔╝██║██║   ██║██║     ██║   ██║╚════╝██║   ██║   ██║██║   ██║██║     
echo ██║ ╚═╝ ██║╚██████╔╝███████╗██║   ██║      ██║   ╚██████╔╝╚██████╔╝███████╗
echo ╚═╝     ╚═╝ ╚═════╝ ╚══════╝╚═╝   ╚═╝      ╚═╝    ╚═════╝  ╚═════╝ ╚══════╝
echo user/ip tools
echo.
echo (1) Username Lookup
echo (2) Grabify (must have vpn on) 
echo (3) IP Lookup
echo (4) Link Shortener
set /p input=
if /I %input% == 1 start https://whatsmyname.app
if /I %input% == 2 start https://grabify.link
if /I %input% == 3 start https://www.iplocation.net/ip-lookup
if /I %input% == 4 start https://hyperhost.ua/tools/en/surli?gad_source=1&gad_campaignid=15059007313&gclid=Cj0KCQiA5I_NBhDVARIsAOrqIsbCeMzhhbzRt5C87CpOTJ6cQljBHYpKEvcGi2c4j8y8DBeqPrnjchYaAtl8EALw_wcB
cls
goto snart
